class NewsService {
  List<NewsInfo> getNews() {
    return <NewsInfo>[
      NewsInfo(
          "Лекція «Блокчейн: як працює біткоїн»",
          "Спікер заходу: Роман Левкович, студент 3 курсу факультету прикладної математики та інформатики🔝\n\n🗓Теми лекції:\n👉 що таке блокчейн❓\n👉 як створюють біткоїн та як це працює❓\n⏰ 6 березня, з 16:30 – 18:00\n📍 ауд.270\n\n💫Реєстрація обов'язкова!👇",
          DateTime.parse("20200606"),
          "assets/bitok.jpeg"),
      NewsInfo(
          "Лекція «Блокчейн: як працює біткоїн»",
          "Спікер заходу: Роман Левкович, студент 3 курсу факультету прикладної математики та інформатики🔝\n\n🗓Теми лекції:\n👉 що таке блокчейн❓\n👉 як створюють біткоїн та як це працює❓\n⏰ 6 березня, з 16:30 – 18:00\n📍 ауд.270\n\n💫Реєстрація обов'язкова!👇",
          DateTime.parse("20200606"),
          "assets/bitok.jpeg"),
      NewsInfo(
          "Лекція «Блокчейн: як працює біткоїн»",
          "Спікер заходу: Роман Левкович, студент 3 курсу факультету прикладної математики та інформатики🔝\n\n🗓Теми лекції:\n👉 що таке блокчейн❓\n👉 як створюють біткоїн та як це працює❓\n⏰ 6 березня, з 16:30 – 18:00\n📍 ауд.270\n\n💫Реєстрація обов'язкова!👇",
          DateTime.parse("20200606"),
          "assets/bitok.jpeg"),
    ];
  }
}

class NewsInfo {
  final String Title;
  final String Content;
  final DateTime Time;
  final String Photo;
  NewsInfo(this.Title, this.Content, this.Time, this.Photo);
}
